nbd_fio_results/dev-nbd0_2023-07-17_12:43/rand_r_nbd0_1iodepth_1threads/2048.txt
rand-read: (g=0): rw=randread, bs=(R) 2048KiB-2048KiB, (W) 2048KiB-2048KiB, (T) 2048KiB-2048KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

rand-read: (groupid=0, jobs=1): err= 0: pid=16702: Mon Jul 17 12:44:27 2023
   read: IOPS=811, BW=1623MiB/s (1702MB/s)(31.7GiB/20001msec)
    slat (usec): min=110, max=913, avg=127.10, stdev= 8.08
    clat (usec): min=819, max=203400, avg=1103.34, stdev=1592.79
     lat (usec): min=951, max=203526, avg=1230.66, stdev=1592.79
    clat percentiles (usec):
     |  1.00th=[  947],  5.00th=[  971], 10.00th=[  996], 20.00th=[ 1012],
     | 30.00th=[ 1029], 40.00th=[ 1045], 50.00th=[ 1057], 60.00th=[ 1074],
     | 70.00th=[ 1090], 80.00th=[ 1123], 90.00th=[ 1254], 95.00th=[ 1418],
     | 99.00th=[ 1532], 99.50th=[ 1549], 99.90th=[ 1598], 99.95th=[ 1614],
     | 99.99th=[ 2573]
   bw (  MiB/s): min=  948, max= 1748, per=100.00%, avg=1622.80, stdev=171.56, samples=40
   iops        : min=  474, max=  874, avg=811.35, stdev=85.77, samples=40
  lat (usec)   : 1000=11.82%
  lat (msec)   : 2=88.16%, 4=0.01%, 250=0.01%
  cpu          : usr=0.47%, sys=5.71%, ctx=243782, majf=0, minf=1052
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16229,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1623MiB/s (1702MB/s), 1623MiB/s-1623MiB/s (1702MB/s-1702MB/s), io=31.7GiB (34.0GB), run=20001-20001msec

Disk stats (read/write):
  nbd0: ios=258480/0, merge=0/0, ticks=203492/0, in_queue=184361, util=92.71%